In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Function For Multilevel3

In [9]:
df1 = DataFrame(np.arange(1,26).reshape(5,5),index = [[1,1,2,2,3],[4,5,5,6,6,]],
               columns = [[4,5,5,8,9],[9,8,6,5,4]])

In [10]:
df1

      4   5       8   9
      9   8   6   5   4
1 4   1   2   3   4   5
  5   6   7   8   9  10
2 5  11  12  13  14  15
  6  16  17  18  19  20
3 6  21  22  23  24  25

In [11]:
df1.index.names = ['Index1','Index2']

In [13]:
df1

                4   5       8   9
                9   8   6   5   4
Index1 Index2
1      4        1   2   3   4   5
       5        6   7   8   9  10
2      5       11  12  13  14  15
       6       16  17  18  19  20
3      6       21  22  23  24  25

In [14]:
df1.columns.names =['Columns1','Columns2']

In [15]:
df1

Columns1        4   5       8   9
Columns2        9   8   6   5   4
Index1 Index2
1      4        1   2   3   4   5
       5        6   7   8   9  10
2      5       11  12  13  14  15
       6       16  17  18  19  20
3      6       21  22  23  24  25

In [16]:
df1.index

MultiIndex([(1, 4),
            (1, 5),
            (2, 5),
            (2, 6),
            (3, 6)],
           names=['Index1', 'Index2'])

In [17]:
df1.columns

MultiIndex([(4, 9),
            (5, 8),
            (5, 6),
            (8, 5),
            (9, 4)],
           names=['Columns1', 'Columns2'])

In [18]:
df1.swaplevel(0)

Columns1        4   5       8   9
Columns2        9   8   6   5   4
Index2 Index1
4      1        1   2   3   4   5
5      1        6   7   8   9  10
       2       11  12  13  14  15
6      2       16  17  18  19  20
       3       21  22  23  24  25

In [19]:
df1.swaplevel(0,axis =1)

Columns2        9   8   6   5   4
Columns1        4   5   5   8   9
Index1 Index2
1      4        1   2   3   4   5
       5        6   7   8   9  10
2      5       11  12  13  14  15
       6       16  17  18  19  20
3      6       21  22  23  24  25

In [20]:
df1.sort_index(level =0 , axis = 0)

Columns1        4   5       8   9
Columns2        9   8   6   5   4
Index1 Index2
1      4        1   2   3   4   5
       5        6   7   8   9  10
2      5       11  12  13  14  15
       6       16  17  18  19  20
3      6       21  22  23  24  25

In [21]:
df1.sort_index(level =1 , axis = 0)

Columns1        4   5       8   9
Columns2        9   8   6   5   4
Index1 Index2
1      4        1   2   3   4   5
       5        6   7   8   9  10
2      5       11  12  13  14  15
       6       16  17  18  19  20
3      6       21  22  23  24  25

In [22]:
df1.sort_index(level =0 , axis = 1)

Columns1        4   5       8   9
Columns2        9   6   8   5   4
Index1 Index2
1      4        1   3   2   4   5
       5        6   8   7   9  10
2      5       11  13  12  14  15
       6       16  18  17  19  20
3      6       21  23  22  24  25

In [23]:
df1.sort_index(level =1 , axis = 1)

Columns1        9   8   5       4
Columns2        4   5   6   8   9
Index1 Index2
1      4        5   4   3   2   1
       5       10   9   8   7   6
2      5       15  14  13  12  11
       6       20  19  18  17  16
3      6       25  24  23  22  21

### TReating Duplicting3

In [24]:
import pandas as pd
import numpy as np
from pandas import Series , DataFrame

In [27]:
ser1 = Series([1,2,3,1,4,4,5,1,3])

In [28]:
ser1

0    1
1    2
2    3
3    1
4    4
5    4
6    5
7    1
8    3
dtype: int64

In [29]:
ser1.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
6    False
7     True
8     True
dtype: bool

In [30]:
ser1 .duplicated(keep = 'last')

0     True
1    False
2     True
3     True
4     True
5    False
6    False
7    False
8    False
dtype: bool

In [33]:
ser1.drop_duplicates()

0    1
1    2
2    3
4    4
6    5
dtype: int64

In [34]:
ser1.drop_duplicates(keep ='last')

1    2
5    4
6    5
7    1
8    3
dtype: int64

In [37]:
df1 = DataFrame({'Key1':list('AABBB'),'Key2':[1,1,1,2,2]})

In [38]:
df1

  Key1  Key2
0    A     1
1    A     1
2    B     1
3    B     2
4    B     2

In [39]:
df1.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [42]:
df1.duplicated(keep ='last')

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [43]:
df1.duplicated('Key1')

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [44]:
df1.drop_duplicates('Key1')

  Key1  Key2
0    A     1
2    B     1

### Combining Two Data3

In [46]:
import numpy as np
import pandas as pd
from pandas import Series ,DataFrame

In [58]:
sero1 = Series([np.nan,2,np.nan,4,np.nan,np.nan])
sero1

0    NaN
1    2.0
2    NaN
3    4.0
4    NaN
5    NaN
dtype: float64

In [59]:
ser2 = Series([1,2,3,4,5,6])

In [60]:
ser2

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [57]:
sero1.combine_first(ser2)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

SyntaxError: incomplete input (1231833347.py, line 1)